content/blog/walk-think.md
+++
title = "Philosopher's Walk 30 Day Challenge"
author = ["santi"]
tags = ["philosophy"]
draft = false
weight = 1005
+++

I've decided to do a experiment. I'm doing a 30 day walk challenge.

I'll call it "Philosopher's Walk Challenge"

> “I can only meditate when I am walking. When I stop, I cease to think; my mind only works with my legs.”
>- Jean-Jacque Rousseau

For the past years I've been obsessed with philosophy, particularly Stoicism. In my journey towards learning about all types of philosophers I've come across the fact that the best thinkers trusted in the power of walks to free their mind from stress and replace that stress for creativity.

I've never been an avid walker. This time I want to take walks where I detach from my phone, that means no music, no audio-books, no podcast, just thoughts.


### Rules {#rules}

> No phone allowed

> Company is permitted


## Day 1 {#day-1}

During this walk I didn't try to purposefully think about any problem in particular. Naturally my urge to turn everything I do into some creative idea lead me down a strange path.

I wanted to do this 30 day walk challenge to build the habit of walking. I thought it would be cool to write a blogpost about my experience.
This quickly got out of control into the following thoughts.

-   I can track my daily thoughts
-   I can measure data on things like time, distance
-   I can go even further, tracking my mood per day

It quickly got out of hand into the full fledged blogpost that you are reading right now.


## Day 2 {#day-2}

I had a bit of a stressful walk, it started alright and it was great to be out after a busy day. In the middle of the walk I remembered I need to sort out some freelance tax stuff urgently, so I was anxious to go back home quickly to sort it out.

Thankfully, since I was walking my dog Zizu with my girlfriend I had a nice talk with her and did the best to relax. Now that I am hope I sorted taxes out and feel a better. I can't wait for tomorrow's walk though.


## Day 3 {#day-3}

Walk in nature with girlfriend, mom and my dog Zizu, amazing experience much needed.

We went to a beautiful river which is 30 minutes drive away, that's the best part of Ecuador amazing nature not so far away from home.


## Day 4 {#day-4}

I couldn't sleep last night, I was overthinking, not necessarily stressful stuff. I was having tons of ideas, my ideas where having ideas. This is often exciting, but when feeling sleep deprived something I doubt my ability to excuse this ideas.

Today I've been feeling tired after a bad night sleep. I value sleep more than I value most things, so even thought I was feeling a bit lazy for this walk, I had a great time walking Zizu, and letting the ideas flow.

I even came up with a nice sounding quote:

>Don't let insecurities hide behind what looks like resonable excuses.


## Day 5 {#day-5}

I was getting obsessed over learning a certain subject that I'm passionate about, I hit a wall of overwhelm, this is where thankfully I forced myself to go for a walk.


## Day 6 {#day-6}

I was feeling pretty stressed, I'm happy I forced myself to go for this walk. I feel a bit overwhelmed by certain stressful things I need to do, but I can definitely see how the walk helped free some tension.


## Day 7 {#day-7}

I usually go for my walk in the afternoon. I started experiencing some anxiety during the morning. I just came back from it and I do feel better than I did. I've been feeling overwhelmed this last couple of days. I know there will be days where I don't see the point in walking nor on keeping this log of my thoughts.

I just have to trust that the walk will benefit me, and that this track of my thoughts might help someone else as well to do the same.


## Day 8 {#day-8}

Today was satisfying, I had a productive work session, I actually finished video editing project that process that usually takes me over 3 hours in almost half the time. Going for my daily walk felt like a nice transition to the next things I want to do with my day. I'm in a good mood right now, ready to take onto more fulfilling work.
